Repository: mozilla-l10n/mt-training-data
Catalog: rw/rw_pontoon.tmx
Source language: en_us
Languages: rw

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
rw: Dutekereza ko amakusanyirizo magari y'amajwi agerwaho na buri wese azateza imbere guhanga ibishya n'ihiganwa mu bucuruzi by'ikoranabuhanga ry'amajwi/ imvugo rifatiye ku kwiga kw'imashini. Iki ni igikorwa cyo ku isi yose, tukaba dusaba buri wese kukigiramo uruhare. Intego yacu ni ugufasha ikoranabuhanga rirebana n'imvugo/ amajwi kutagira uwo riheza, rikarangwa n'urunyurane rw'amajwi aturutse mu mpande enye z'isi.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
rw: Dutekereza ko amakusanyirizo magari y'amajwi agerwaho na buri wese azateza imbere guhanga ibishya n'ihiganwa mu bucuruzi by'ikoranabuhanga ry'amajwi/ imvugo rifatiye ku kwiga kw'imashini. Ikusanyirizo mpuzandimi ry'imbonwa z'amajwi rikaba rimaze kuba ari ryo rigari rizwi mu yandi yose akora ibisa n'ibyaryo, ariko si ryo ryonyine ribaho.

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
rw: Tubara amasaha mu kugenekereza impuzandengo y'uburebure bwa buri kintu cyafashwe n'ibyuma mfatamajwi tugakuba uwo mubare n'igiteranyo cyose k'ibyafashwe mu ndimi zose.

source: We don't have anything to validate in this language, help us fill the queue.
rw: Nta kindi twemeza muri uru rurimi, dufashe kuzuza urutonde.

source: Welsh
rw: Ikigaruwa

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
rw: Tubijeje kwifashisha amakuru muduha tubyitayeho. Soma ibindi mu byo twakwandikiye ku murongo wawe bwite.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
rw: Turakora ivomo rusange ry'ikusanyirizo mpuzandimi ry'amajwi uwo ari we wese ashobora gukoresha kwitoza porogaramu ntahurajwi

source: We’re sorry, but your platform is not currently supported.
rw: Tubiseguyeho kuko ihuriro ryanyu ritashyizwe muri porogaramu

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
rw: Twifuza ko ikusanyirizo ry'imbonwa ry'Ijwi Rusange (Common Voice) riba ryiza ku buryo ihura n'imashini ishobora kumva mu no mu bihuru, mbese twifuza ibinyuranye. Ikindi kijyanye bantu batandukanye bakoresha ururimi, ikusanyirizo ririmo amajwi anyuranye azatuma imashini imenya uko ikoresha amajwi atandukanye mu bihe bisanzwe bitandukanye birimo imvugo zirimo andi majwi cyangwa urusaku cyangwa imodoka zihinda. Igihe cyose ijwi ryawe ryumvikana, rizaba rihagije ari n'ingirakamaro ku ikusanyirizo ry'imbonwa z'amajwi.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
rw: Tuzakomeza twungurane ibitekerezo by'uko twakongera ururimi rwawe muri porogaramu y'Ijwi Rusange bidatinze.

source: We will be in touch with more information as it becomes available.
rw: Tuzakomeza guhana amakuru uko azajya aboneka.

source: We will not make your email public.
rw: Ntituzagira rusange imeri yawe.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
rw: Tuzasubiramo tugenzure ugusaba kwawe ko amajwi wafashe akurwa mu ikusanyirizo ry'imbonwa. Igihe byemejwe, tuzasaba abamanuye ibyo mu ikusanyirizo gukuramo amajwi yawe wafashe.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
rw: Kugena irangamimerere ry'abavuga mu ikusanyirizo rya porogaramu y'Ijwi Rusange bisobanuye iki?

source: What is Common Voice?
rw: Ijwi Rusange (Common Voice) ni iki?

source: What level of audio quality is required for a voice clip to be used in the dataset?
rw: Ijwi rishyirwa mu ikusanyirizo ry'amajwi rigomba kuba riri ku ruhe rwego, rifite irihe reme?

source: What’s inside the Common Voice dataset?
rw: Mu ikusanyirizo ry'imbonwa rya porogaramu y'Ijwi Rusange harimo iki?

source: What's Public?
rw: Ni iki Rusange?

source: What’s the difference between Common Voice and Deep Speech?
rw: Ni irihe tandukaniro hagati y'Ijwi Rusange (Common Voice) n'Imvugo Inimbitse (Deep Speech)?

source: When will you release Common Voice data in other languages?
rw: Muzatangaza ryari imbonwa z'Ijwi Rusange (Common Voice) mu zindi ndimi?

source: Where does the source text come from?
rw: Imvano y'imyandiko yo ituruka he?

source: Why a profile?
rw: Kuki isura ndanga ari ngombwa?

source: Why does this matter?
rw: Kubera iki ibi ari ngombwa/ ari ingenzi?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
rw: Kuki mudasaba abantu gusoma ibitabo cyangwa ibyandikwa kuri Wikipediyamu ndimi zinyuranye?

source: Why do you need so many different speakers per language?
rw: Kuki dukeneye amavuga batandukanye benshi kuri buri rurimi?

source: Why is 10,000 validated hours the per language goal for capturing audio?
rw: Kuki ari ngombwa kugeza ku masaha 10,000 yemejwe y'amajwi yafashwe kuri buri rurimi?

source: Why is Common Voice part of the Mozilla mission?
rw: Kuki Ijwi Rusange ari imwe mu nshingano za Mozilla?

source: Why is it important?
rw: Kubera iki ari ingirakamaro?

source: Why is my language not included yet?
rw: Kuki ururimi rwange rutari rwashyirwamo?

source: Why should I sign up for an account?
rw: Kuki ngomba kugira konti?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
rw: Ushaka gusaba ko amajwi yawe wafashe na yo asibwa, cyangwa usanga yagumishwa mu ikusanyirizo ry'imbonwa rya porogaramu Ijwi Rusange?

source: Yes
rw: Yego

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
rw: Yego. Munyoherereze imeri. Ndashaka gukomeza kubona amakuru yerekeye umushinga wa "Common Voice".

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
rw: Yego, munyoherereze imeri. Ndashaka guhora nzi amakuru y'urur rurimi muri "Common voice".

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
rw: Yego, dukeneye rwose ijwi ryawe! Imwe mu migambi y'Ijwi Rusange ni ukwegeranya imvugo zitandukanye zishoboka kugira ngo abashinzwe iby'itahurajwi babashe gukorera neza buri wese ku rwego rumwe.Ni yo mpamvu ijwi ry'utari kavukire w'ururimi rifite akamaro gakomeye.

source: You
rw: Wowe

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
rw: Ugiye gutangira kumanura jigabayite, ukomeze?

source: You are prepared to initiate a download of <b>{ $size }</b>
rw: Witeguye gutangira kumanura ....

source: You can choose to make your username public or anonymous.
rw: Ushobora guhitamo kwerekana izina ndanga ukoresha cyangwa nturyerekane.

source: You must allow microphone access.
rw: Ugomba kwemerera gukoresha mikoro

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
rw: Amajwi yawe wafashe atagomba gushyirwa ahagaragara aguma mu ikusanyirizo ry'imbonwa rya porogaramu y'Ijwi Rusange. Iyo uhanaguye isura ndanga yawe, ntuzaba ugishoboye kugira ubwo usaba gukura amajwi wafashe mu ikusanyirizo ry'imbonwa.

source: Your download has started.
rw: Imanura wakoze ryatangiye.

source: Your Languages
rw: Indimi zawe

source: Your username and email will not be associated with the published data.
rw: Izina ndanga ryawe na imeri ntibizajya hamwe n'imbonwa zizatangazwa.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
rw: Wafashije porogaramu y'Ijwi Rusange kugeza ku mugambi wacu w'amajwi agomba gufatwa buri munsi.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
rw: Wafashije porogaramu y'Ijwi Rusange kugeza ku mugambi wacu w'ibyemezwa ku munsi.

source: You've successfully signed up for contributing to { $language }. Thank you.
rw: Washoboye neza guhamya gutanga umusanzu mu . Urakoze.
